<a href="https://colab.research.google.com/github/francomanca93/analisis-de-datos/blob/comienzo/1-Comenzando-con-pandas/6_Diferentes_formatos_para_datasets.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Diferentes formatos para datasets

Se verá en este notebook ventajas y desventajas de trabajar con otros formatos para datasets. Como guardar nuestro dataframe utilizando otros tipos de formatos.

Existen diferentes formatos, entre estos estan los siguientes:

* **CSV** - Es muy versatil ya que solo tiene comas y saltos de linea.
* **JSON** - Tiene un formato muy similar al de un diccionario de Python.
* **Excel** - Permite guardar el archivo en formato .xls para trabajar con el en Excel o Spreadsheets.
* **Pickle** - Permite comprimir la información, es util cuando se tienen tablas grandes.
* **Parquet** - Permite darle un formato que puede usarse en ambientes de Big Data como Hadoop.

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /content/drive

In [2]:
%cd '/content/drive/My Drive/Colab Notebooks/analisis-de-datos-con-pandas'
!ls

/content/drive/My Drive/Colab Notebooks/analisis-de-datos-con-pandas
'1. Configurando Google.ipynb'	'5.Conexión con bases de datos tipo SQL .ipynb'
 2.Series.ipynb			'6.Diferentes formatos para datasets.ipynb'
 3.Dataframes.ipynb		 db
'4. Guardar y cargar.ipynb'

In [3]:
dir_pandas = '/content/drive/My Drive/Colab Notebooks/analisis-de-datos-con-pandas/db/{}'
dir_pandas

'/content/drive/My Drive/Colab Notebooks/analisis-de-datos-con-pandas/db/{}'

In [11]:
import pandas as pd
import numpy as np

dict_data = {
    'edad': [10,9,13,14,12,11,12],
    'cm': [115,110,130,155,125,120,125],
    'pais':['co','mx','co','mx','mx','ch','ch'],
    'genero':['M','F','F','M','M','M','F'],
    'Q1':[5,10,8,np.nan,7,8,3],
    'Q2':[7,9,9,8,8,8,9]
}

df = pd.DataFrame(dict_data)
print(df)

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8
5    11  120   ch      M   8.0   8
6    12  125   ch      F   3.0   9

## Formato excel

In [13]:
df.to_excel(dir_pandas.format('test.xlsx'), index=False, sheet_name='Hoja_uno')

In [14]:
dir_pandas.format('test.xlsx')

'/content/drive/My Drive/Colab Notebooks/analisis-de-datos-con-pandas/db/test.xlsx'

In [15]:
pd.read_excel(dir_pandas.format('test.xlsx'))

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8
5    11  120   ch      M   8.0   8
6    12  125   ch      F   3.0   9

## Formato JSON

Formato muy común cuando se consultan bases de datos a través de API's

In [16]:
df.to_json(dir_pandas.format('test.json'))

In [17]:
pd.read_json(dir_pandas.format('test.json'))

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8
5    11  120   ch      M   8.0   8
6    12  125   ch      F   3.0   9

## Formato Pickle

Se usa cuando la base de datos tiene un tamaño mediano considerable.

In [19]:
df.to_pickle(dir_pandas.format('test.pkl'))

In [20]:
pd.read_pickle(dir_pandas.format('test.pkl'))

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8
5    11  120   ch      M   8.0   8
6    12  125   ch      F   3.0   9

## Formato Parquet

Formato muy utilizado cuando hablamos de Big Data.

In [21]:
df.to_parquet(dir_pandas.format('test.parquet'))

In [23]:
pd.read_parquet(dir_pandas.format('test.parquet'))

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8
5    11  120   ch      M   8.0   8
6    12  125   ch      F   3.0   9

In [24]:
df.to_hdf(dir_pandas.format('test.hdf'), key='data', format='table')

In [25]:
pd.read_hdf(dir_pandas.format('test.hdf'))

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8
5    11  120   ch      M   8.0   8
6    12  125   ch      F   3.0   9